dylankainth/blades/hardware/waveshare-amoled/firmware/sdkconfig.defaults
# ---- Target / board: Waveshare ESP32-S3-Touch-AMOLED-1.8 (ESP32-S3R8: 8MB octal PSRAM
# in the package, 16MB external QSPI flash)
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# The USB-C goes straight to the S3's native USB (GPIO19/20), there is no
# UART bridge. Log over USB-Serial-JTAG so `idf.py monitor` on /dev/ttyACM0 works.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ---- PSRAM: the S3R8's 8MB PSRAM is octal; quad mode fails at boot.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ---- BLE: NimBLE (much smaller than Bluedroid), advertise only.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
# Wi-Fi + BLE software coexistence (default y when both are enabled; pinned here).
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# ---- TLS: keep mbedTLS buffers out of internal RAM; use the built-in CA bundle.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y

# ---- LVGL 9
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# ---- Touch: only relevant on a V2 board (CST820). That chip sleeps between
# touches and NACKs while asleep, so do not make start-up depend on reading its ID.
CONFIG_ESP_LCD_TOUCH_CST816S_DISABLE_READ_ID=y

# ---- Power: the badge runs from its own battery and must never doze off.
# No power management / light sleep / tickless idle (these are the defaults; pinned).
CONFIG_PM_ENABLE=n
CONFIG_FREERTOS_USE_TICKLESS_IDLE=n

# Button callbacks run in the esp_timer task and repaint the UI (demo mode).
CONFIG_ESP_TIMER_TASK_STACK_SIZE=8192
